/* 
	
*/
var facetype;
var status = -1;
var beauty = -1;
var faceCard = -1;
var types = -1;
var ct = -1;

function action(mode, type, selection) {
    if (mode == 0) {
		if (status != 1 && beauty != -1) {
			cm.sendOk("你还没做好心理准备吗？决定好了之后，请你再来和我说话。");
		}
        cm.dispose();
        return;
    } else {
        status++;
    }
    if (status == 0) {
        cm.sendSimple("你好，我是整形手术领域的艺术家#b#p2012036##k。如果你有#b#t05152053##k，我可以为你做脸部整形手术。怎么样？ 你想让自己的脸变得完美无瑕吗？\r\n#b#L0#换脸(使用皇家整容优惠劵)#l\r\n#b#L1#换脸(使用经典皇家整容优惠劵)#l\r\n#b#L2#换脸(RED皇家整容优惠劵)#l\r\n#b#L3#换脸(周年庆皇家整容劵)#l");
    } else if (status == 1) {
		var face = cm.getPlayerStat("FACE");
		facetype = [];
        if (selection == 0) {
            beauty = 0;
			faceCard = 5152053;
            if (cm.getPlayerStat("GENDER") == 0) {//皇家
				facetype = [
					20020,//男脸020
					20021,//男脸021
					20022,//男脸022
					20023,//男脸023
					20024,//男脸024
					20025,//男脸025
					20026,//男脸026
					20027,//男脸027
					20028,//男脸028
					20029,//男脸029
					20030,//男脸030-傲视
					20031,//男脸031
					20032,//男脸032
					20033,//男脸033-伪娘
					20035,//男脸035-水灵灵(天真)
					20036,//男脸036-战神
					20037,//男脸037-龙神
					20038,//男脸038-豆豆
					20040,//男脸040
					20043,//男脸043-双瞳色
					20044,//男脸044-深邃大眼男
					20045,//男脸045-个性
					20046,//男脸046-外星人
					20047,//男脸047-漫画
					20048,//男脸048-帅气魔族
					20049,//男脸049-冷酷精灵
					20050,//男脸050-近视
					20051,//男脸051-猫眼
					20052,//男脸052-鬼
					20053,//男脸053
					20054,//男脸054
					20055,//男脸055
					20056,//男脸056
					20057,//男脸057-温和精灵
					20058,//男脸058-耍酷幻影
					20059,//男脸059-温柔幻影
					20060,//男脸060
					20061,//男脸061(豆豆)
					20062,//犀利利
					20063,//男脸063
					20064,//男脸064
					20065,//男脸065-双刀
					20066,//男脸066
					20067,//男脸067
					20068,//男脸068-忧愁
					20069,//男脸069-米哈尔
					20070,//男脸070
					20071,//男脸071-瞳焰红
					20072,//男脸072-瞳焰紫
					20074,//男脸074-坚韧异瞳
					20075,//男脸075-冷静异瞳
					20076,//男脸076-狂龙战士
					20077,//男脸077-铃铛眼
					20080,//男脸080-星星眼
					20081,//男脸081
					20082,//男脸082-凝视
					20083,//懵懂少年
					20084,//男脸084-孤独
					20085,//男脸085-沉着
					20086,//男脸086-斯乌
					20087,//男脸087-端正
					20088,//男脸088
					20089,//男脸089-初心者
					20090,//男脸090-顽皮
					20093,//男脸093
					20094,//雄心勃勃的脸型
					20095,//男脸095
					20096,//男脸096-眈眈
					20097,//男脸097
					20098,//男脸098-正太
					20099,//提斯脸型
					23000,//活力冒险家脸型
					23001,//勇敢的冒险家脸型
					23002,//男脸102
					23003,//伦多脸型
					23004,//男脸104
					23005,//男脸005-奥利弗
					23006,//男脸106
					23008,//??? ??
					23010,//月光（男）
					23011,//聪明玲珑脸型
					23012,//隐月脸型
					23013,//自信脸型
					23014,//纯情脸型
					23015,//古惑仔
					23016,//男脸16-宝玉
					23017,//丹凤眼
					23018,//男脸18-恶魔
					23019,//古惑仔
					23020,//男脸020-大眼睛
					23021,//男脸021
					23023,//男脸023-信心满满
					23024,//睡美男
					23025,//委屈
					23028,//黑瞳
					23031,//深邃大圆眼
				];
			} else {
				facetype = [
					21020,//女脸020
					21021,//女脸021
					21022,//女脸022
					21023,//女脸023
					21024,//女脸024
					21025,//女脸025
					21026,//女脸026
					21027,//女脸027
					21028,//女脸028-卡哇伊
					21029,//女脸029
					21030,//女脸030-嫑笑
					21031,//女脸031-乖小囡(天真)
					21033,//女脸033-水灵灵
					21034,//女脸034-战神
					21035,//女脸035-龙神
					21036,//女脸036-豆豆
					21038,//女脸038
					21041,//女脸041-双瞳色
					21042,//女脸042-深邃大眼女
					21043,//女脸043-个性
					21044,//女脸044-外星人
					21045,//女脸045-漫画
					21046,//女脸046-帅气魔族
					21047,//女脸047-冷酷精灵
					21048,//女脸048-近视
					21049,//女脸049-猫眼
					21050,//女脸050-鬼
					21052,//女脸052
					21053,//女脸053
					21054,//女脸054
					21055,//女脸055-温和精灵
					21056,//女脸056-耍酷幻影
					21057,//女脸057-温柔幻影
					21058,//女脸058
					21059,//女脸059
					21060,//女脸060
					21061,//女脸061-双刀
					21062,//女脸062
					21063,//女脸063
					21064,//女脸064-忧愁
					21065,//朦妹妹
					21066,//女脸066-瞳焰红
					21067,//女脸067-瞳焰紫
					21069,//女脸069-坚韧异瞳
					21070,//女脸070-冷静异瞳
					21071,//女脸071-狂龙战士
					21072,//女脸072-铃铛眼
					21073,//女脸073-萌天使
					21074,//女脸074-聪明诺巴
					21075,//女脸05-可爱诺巴
					21077,//女脸077-大圆眼
					21078,//女脸078
					21079,//阿莉亚脸型
					21080,//女脸080-犹豫
					21081,//女脸081-奥尔卡
					21082,//女脸082-天真
					21083,//女脸083
					21084,//女脸084
					21085,//女脸085-维丽尔
					21086,//女脸086-初心者
					21089,//紫色妖姬
					21090,//凝神脸型
					21091,//女脸091-琉璃眼
					21092,//女脸092-温柔
					21093,//女脸093-水晶葡萄
					21094,//亲切的冒险家脸型
					21095,//非凡冒险家之脸
					21096,//女脸096
					21097,//修嘉脸型
					21098,//女脸098
					21099,//女脸099
					24001,//女脸101-萝莉
					24002,//女脸102
					24003,//??? ??
					24004,//女脸104
					24007,//月光（女）
					24008,//朦妹妹(女隐月)
					24009,//自信脸型
					24010,//纯情脸型
					24011,//女脸11-假睫毛
					24012,//女脸12-黛玉
					24013,//小凤仙
					24014,//女脸14-恶魔
					24015,//古惑囡
					24016,//女脸016-大眼睛
					24019,//糖栗脸型
					24020,//睡美人
					24022,//委屈
					24024,//黑瞳
					24026,//深邃大圆眼
				];
			}
        } else if (selection == 1) {
            beauty = 1;
			faceCard = 5152093;
            if (cm.getPlayerStat("GENDER") == 0) {//经典皇家
				facetype = [
					20030,//男脸030-傲视
					20033,//男脸033-伪娘
					20036,//男脸036-战神
					20040,//男脸040
					20047,//男脸047-漫画
					20050,//男脸050-近视
					20061,//男脸061(豆豆)
					20062,//犀利利
					20074,//男脸074-坚韧异瞳
					20075,//男脸075-冷静异瞳
					23017,//丹凤眼
					23019,//古惑仔
					23031,//深邃大圆眼
				];
			} else {
				facetype = [
					21028,//女脸028-卡哇伊
					21033,//女脸033-水灵灵
					21034,//女脸034-战神
					21035,//女脸035-龙神
					21038,//女脸038
					21045,//女脸045-漫画
					21048,//女脸048-近视
					21069,//女脸069-坚韧异瞳
					21070,//女脸070-冷静异瞳
					21098,//女脸098
					24015,//古惑囡
					24026,//深邃大圆眼
				];
			}
        } else if (selection == 2) {
            beauty = 2;
			faceCard = 5152094;
            if (cm.getPlayerStat("GENDER") == 0) {//RED皇家
				facetype = [
					20037,//男脸037-龙神
					20038,//男脸038-豆豆
					20043,//男脸043-双瞳色
					20071,//男脸071-瞳焰红
					20072,//男脸072-瞳焰紫
					20086,//男脸086-斯乌
					20098,//男脸098-正太
					23005,//男脸005-奥利弗
					23016,//男脸16-宝玉
					23021,//男脸021
					23024,//睡美男
					23025,//委屈
				];
			} else {
				facetype = [
					21036,//女脸036-豆豆
					21041,//女脸041-双瞳色
					21066,//女脸066-瞳焰红
					21067,//女脸067-瞳焰紫
					21079,//阿莉亚脸型
					21081,//女脸081-奥尔卡
					21097,//修嘉脸型
					24012,//女脸12-黛玉
					24020,//睡美人
					24022,//委屈
				];
			}
        } else if (selection == 3) {
            beauty = 3;
			faceCard = 5152098;
            if (cm.getPlayerStat("GENDER") == 0) {//周年庆皇家
				facetype = [
					20035,//男脸035-水灵灵(天真)
					20044,//男脸044-深邃大眼男
					20046,//男脸046-外星人
					23004,//男脸104
					23020,//男脸020-大眼睛
					23028,//黑瞳
				];
			} else {
				facetype = [
					21031,//女脸031-乖小囡(天真)
					21042,//女脸042-深邃大眼女
					21044,//女脸044-外星人
					21099,//女脸099
					24001,//女脸101-萝莉
					24016,//女脸016-大眼睛
					24024,//黑瞳
				];
			}
        }
		var iNow = 0;
		var faceTypeNow = [];
		for (var i = 0; i < facetype.length; i++) {
			if (facetype[i] != face-face%1000+face%100) {
				faceTypeNow[iNow++] = facetype[i] + face % 1000 - (face % 100);
			}
		}
		facetype = cm.getCanFace(faceTypeNow);
		cm.sendSimple("那么你想...\r\n#b#L0#看看这个皇家有什么脸型#l\r\n#b#L1#变换脸型#l");
    } else if (status == 2) {
        if (selection == 0) {
			types = 0;
			if (facetype.length == 0)
				cm.sendOk("出现未知错误。");
			else
				cm.askAvatar("随便看", facetype, faceCard);
        } else if (selection == 1) {
			types = 1;
			cm.sendYesNo("使用皇家整容院优惠劵，可以随意更改脸型。但是请别担心，我的手术已经达到了一树的境界。你真的要使用#b#t0" + faceCard + "##k，变换脸型吗？");
		}
    } else if (status == 3) {
        if (types == 0) {
			status = 0;
			action(mode, type, beauty);
		} else {
			if (cm.setRandomAvatar(faceCard, facetype) == 1) {
				cm.sendOk("好了,你的朋友们一定认不出你了!");
				cm.safeDispose();
			} else {
				if (beauty == 0) {
					cm.sendYesNo("您没有可使用的会员卡。是否想消耗980抵用券直接使用？");
				} else {
					cm.sendOk("必须要有皇家整容优惠劵，才能进行手术。");
					cm.safeDispose();
				}
			}
		}
    } else if (status == 4) {
		status = 2;
		if (cm.getChar().getCSPoints(1) >= 980)
			ct = 1;
		if (cm.getChar().getCSPoints(2) >= 980)
			ct = 2;
		if (ct != -1) {
			ct = -1;
			if (cm.gainNX(ct, -980)){
				cm.gainItem(faceCard, 1);
			}else{
				cm.sendOk("你好像没有足够的点卷/抵用卷!");
				cm.dispose();
			}
			
		} else {
			beauty = -1;
		}
		action(mode, type, selection);
    }
}