function start() {
	status = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
	if (mode == -1) {
		cm.dispose();
	} else {
		if (status >= 0 && mode == 0) {
			cm.sendOk("有事请点我没事给我滚蛋，刚才的小逼崽子没东西还想要#v2434354#已经被我扔到基佬群了你想跟他一样么..");
			cm.dispose();
			return;
		}
		if (mode == 1) {
			status++;
		} else {
			status--;
		}
		if (status == 0) {
			cm.sendSimple("#g---------------※ #e#r星  #b座  #d任  #r务#g ※--------------\r\n\r\n#d你好，我是圣诞老人，你可以帮我办点事吗？当然啦，事成之后我会给予你我收藏多年的星座椅子箱，那可是能开出十二星座的座椅噢，#r星座椅子箱#v2434354#？还有几率出红宝石#v4001323#\r\n\r\n#v3015015##v3015016##v3015017##v3015018##v3015019##v3015020##v3015021##v3015022##v3015023##v3015024##v3015025##v3015026##v4001323#\r\n\r\n#b小伙子心动不？圣诞节快到了，海盗抢了我准备的礼物，去帮我抢回圣诞节袜子礼物#v4001395##r温馨提示:你可以去红鼻子海盗团老巢2 给我30个袜子可以兑换一个星座椅子箱\r\n\r\n#L1##b点击我，兑换星座椅子箱#l");
		} else if (status == 1) {
			if (selection == 1) {
				if (cm.haveItem(4001395) >= 30) {
					cm.gaimItem(4001395, -30);
					cm.gainItem(2434354, 1)
					cm.sendOks("小伙子啊，谢谢你帮我抢回了礼物，这是星座椅子箱#v2434354#请收好，我这还有不少星座椅子箱，如果你能再抢回30个袜子，可以继续和我兑换");
					cm.dispose();
				} else {
					cm.sendOk("小逼崽子，妈的没能力别和我说话  滚！！！ 老子不想在看见你 ");
					//cm.sendOk("你是逼痒了还是咋滴，信不信我找基佬强奸你");
					cm.dispose();
				}
			}
		}
	}
}