var status = 0;
var ag = "#fEffect/CharacterEff/1082565/0/0#"; //兔子灰
var EventId = "累计赞助奖励";
var giftLevel = [50, 100, 300, 500, 1000, 1500, 2000, 3000, 5000, 8000, 10000];
var giftContent = [

		//50累计赞助
		[2431945, 1, 0], //140级防具箱
		[5062009, 20, 0], //超级神奇魔方
		[5062500, 10, 0], //大师附加神奇魔方
		[2049116, 5, 0], //强化混沌卷轴
		[2340000, 5, 0], //祝福卷轴
		[2049124, 3, 0], //正向混沌卷轴
		[2430683, 1, 0], //情人节 卷轴箱子
		[2048721, 1, 0], //永远涅槃火焰
		[4001839, 100, 0],//星星
		[3010124, 1, 0],//都纳斯喷气椅子
		
		//100累计赞助
		[2431945 ,1 ,1],//140级防具箱
		[2431944 ,1 ,1],//140级武器箱
		[5062009 ,30 ,1],//超级神奇魔方
		[5062002 ,50, 1],//高级神奇魔方
		[5062024 ,10 ,1],//闪炫魔方
		[2430683, 10 ,2]//情人节 卷轴箱子
		[2048721 ,2 ,1],//永远涅槃火焰
		[2340000 ,5 ,1],//祝福卷轴
		[2049116 ,5 ,1],//强化混沌卷轴
		[2049124 ,5 ,1],//正向混沌卷轴
		[4001839 ,200 ,1],//星星
		[3010511 ,1 ,1],//猫咪公园椅子
		
		//300金额礼包
		[1142249 ,1 ,2],//我是幸运儿
		[1003720 ,1 ,2],//进阶半半头盔
		[2431944 ,1 ,2],//140级武器箱
		[5062009 ,40 ,2],//超级神奇魔方
		[5062002 ,50 ,2],//高级神奇魔方
		[5062500 ,50 ,2],//大师附加神奇魔方
		[5062024 ,10 ,2],//闪炫魔方
		[2049705 ,3 ,2],//A级潜能附加卷轴 50%
		[2430683 ,3 ,2],//情人节 卷轴箱子
		[2048721 ,3 ,2],//永远涅槃火焰
		[5064000 ,5 ,2],//防爆卷轴
		[2340000 ,5 ,2],//祝福卷轴
		[2049116 ,5 ,2],//强化混沌卷轴
		[2049124 ,5 ,2],//正向混沌卷轴
		[4001839 ,300 ,2],//星星
		[4001715 ,1 ,2],//定居金1亿金钱
		[3010751 ,1 ,2],//鲸鱼椅子
		[3012002 ,1 ,2],//浴桶

		//500金额礼包
		[2431938,1,3],//法弗纳武器自选箱
		//[2434666,1,3],//自乐的箱子
		[2434666,1,3],//真红耳环
		[4310036,5000,3],//征服者币
		[4001126,2000,3],//枫叶
		[2049750,1,3],//S级其潜能卷轴 80%
		[5062009,50,3],//超级神奇魔方
		[5062002,50,3],//高级神奇魔方
		[5062024,10,3],//闪炫魔方
		[2430683,5,3],//情人节 卷轴箱子
		[2048721,4,3],//永远涅槃火焰
		[5064000,5,3],//防爆卷轴
		[5062500,50,3],//大师附加神奇魔方
		[2049509,2,3],//金色刻印印章
		[2048301,2,3],//金光潜能附加印章
		[2340000,10,3],//祝福卷轴
		[2049116,10,3],//强化混沌卷轴
		[2049124,10,3],//正向混沌卷轴
		[2049155,5,3],//惊人正义混沌卷轴 50%
		[2049705,3,3],//A级潜能附加卷轴 50%
		[4001839,500,3],//星星
		[4001715,1,3],//定居金1亿金钱
		[3010826,1,3],//地球椅子
		[3010183,1,3],//胡萝卜椅子

//1000金额礼包
		[3994417,1,4],//红色蜡笔
		[3994418,1,4],//橙色蜡笔
		[3994419,1,4],//黄色蜡笔
		[2431994,1,4],//秘密箱子
		[2430887,1,4],//风暴礼物箱 法弗纳防具自选箱
		[1113070,1,4],//真红之环
		[2590008,1,4],//特殊灵魂附魔石
		[2591391,1,4],//伟大的皮埃尔灵魂结晶
		[5062009,100,4],//超级神奇魔方
		[5062002,100,4],//高级神奇魔方
		[5062024,20,4],//闪炫魔方
		[5062500,50,4],//大师附加神奇魔方
		[2048301,5,4],//金光潜能附加印章
		[2049509,5,4],//金色刻印印章
		[2430683,8,4],//情人节 卷轴箱子
		[2048721,5,4],//永远涅槃火焰
		[2340000,30,4],//祝福卷轴
		[2049116,15,4],//强化混沌卷轴
		[2049124,15,4],//正向混沌卷轴
		[2049155,10,4],//惊人正义混沌卷轴 50%
		[2049705,3,4],//A级潜能附加卷轴 50%
		[4001839,1000,4],//星星
		[4001715,1,4],//定居金1亿金钱
		[3015349,1,4],//青蛙摇摇机椅子

		//1500金额礼包
		[2432069,1,5],//暴君防具交换券
		[1113075,1,5],//最高级贝勒德戒指
		[1113074,1,5],//高级贝勒德戒指
		[1012319,1,5],//8周年点点红
		[1152155,1,5],//真红护肩
		[2049750,3,5],//S级其潜能卷轴 80%
		[5064000,10,5],//防爆卷轴
		[5062500,100,6],//大师附加神奇魔方
		[5062024,50,5],//闪炫魔方
		[5062009,100,5],//超级神奇魔方
		[5062002,100,5],//高级神奇魔方
		[2048301,8,5],//金光潜能附加印章
		[2049509,8,5],//金色刻印印章
		[2430683,10,5],//情人节 卷轴箱子
		[2048721,8,5],//永远涅槃火焰
        [2049323,15,5],//高级装备强化卷轴
		[2340000,40,5],//祝福卷轴
		[2049116,20,5],//强化混沌卷轴
		[2049124,20,5],//正向混沌卷轴
		[2049155,15,5],//惊人正义混沌卷轴 50%
		[2049705,8,5],//A级潜能附加卷轴 80%
		[4001839,2000,5],//星星
		[4001715,2,5],//定居金1亿金钱
		[3010843,1,5],//兔兔郊游房车
		[3015382,1,5],//飞翔吧！悟空椅子
		[3015443,1,5],//打倒小羊驼椅子

		//2000金额礼包
		[3994417,1,6],//红色蜡笔
		[3994418,1,6],//橙色蜡笔
		[3994419,1,6],//黄色蜡笔
		[1142803,1,6],//安德洛墨达之贵宾
		[1662039,1,6],//奥尔卡机器人
		[1672027,1,6],//极真锂心脏
		[1032219,1,6],//遗忘之神话耳环
		[1132246,1,6],//最高级贝勒德刻印腰带
		[1022226,1,6],//独眼巨人之眼Lv.3
		[2430683,12,6],//情人节 卷轴箱子
		[2048721,10,6],//永远涅槃火焰
		[5064000,20,6],//防爆卷轴
		[2340000,50,6],//祝福卷轴
		[5062009,100,6],//超级神奇魔方
		[5062500,100,6],//大师附加神奇魔方
		[5062024,100,6],//闪炫魔方
		[2049750,5,6],//S级潜能卷轴 80%
		[2049509,8,6],//金色刻印印章
		[2049323,30,6],//高级装备强化卷轴
		[2049116,20,6],//强化混沌卷轴
		[2049124,20,6],//正向混沌卷轴
		[2049155,15,6],//惊人正义混沌卷轴 50%
		[2049155,8,6],//A级潜能附加卷轴 50%
		[4001839,2000,6],//星星
		[4001715,3,6],//定居金1亿金钱
		[3015234,1,6],//少年沙滩聚会
		[3010142,1,6],//水族馆椅子
		[3010500,1,6],//云朵洗手间椅子
		[3010528,1,6],//跑步机椅子

		//3000金额礼包
		[3994417,1,7],//红色蜡笔
		[3994418,1,7],//橙色蜡笔
		[3994419,1,7],//黄色蜡笔
		[3994420,1,7],//绿色蜡笔
		[4001330,1,7],//青色蜡笔
		[3994422,1,7],//蓝色蜡笔
		[1142796,1,7],//官服认证男神
		[2431994,3,7],//秘密箱子
		[2430887,3,7],//风暴礼物箱 法弗纳防具自选箱
		[5064000,30,7],//防爆卷轴
		[2340000,100,7],//祝福卷轴
		[5062009,150,7],//超级神奇魔方
		[5062002,200,7],//高级神奇魔方
		[5062500,200,7],//大师附加神奇魔方
		[5062024,150,7],//闪炫魔方
		[2049750,30,7],//S级其潜能卷轴 80%
		[2049155,30,7],//惊人正义混沌卷轴 50%
		[2049323,50,7],//高级装备强化卷轴
		[2430683,15,7],//情人节 卷轴箱子
		[2048721,12,7],//永远涅槃火焰
		[2048301,8,7],//金光潜能附加印章//
		[2049509,8,7],//金色刻印印章
		[2049116,20,7],//强化混沌卷轴
		[2049124,20,7],//正向混沌卷轴
		[4001839,2000,7],//星星
		[4001715,5,7],//定居金1亿金钱
		[3010876,1,7],//冒险岛行星椅子
		[3015193,1,7],//被驯服的鲸鱼椅子
		[3015431,1,7],//冒险岛电动缆车椅子

		//5000金额礼包
		[3994417,1,8],//红色蜡笔
		[3994418,1,8],//橙色蜡笔
		[3994419,1,8],//黄色蜡笔
		[3994420,1,8],//绿色蜡笔
		[4001330,1,8],//青色蜡笔
		[3994422,1,8],//蓝色蜡笔
		[1132246,1,8],//最高级贝勒德刻印腰带
		[1122267,1,8],//最高级贝勒德刻印吊坠
		[1032223,1,8],//最高级贝勒德耳环
		[1113075,1,8],//最高级贝勒德戒指
		[3010822,1,8],//贪吃鳄鱼椅子
		[3015343,1,8],//冰雪企鹅王椅子 
		[2430683,20,8],//情人节 卷轴箱子
		[2048721,15,8],//永远涅槃火焰
		[5064000,50,8],//防爆卷轴
		[2340000,100,8],//祝福卷轴
		[5062009,200,8],//超级神奇魔方
		[5062002,300,8],//高级神奇魔方
		[5062500,300,8],//大师附加神奇魔方
		[5062024,150,8],//闪炫魔方
		[2049750,50,8],//S级其潜能卷轴
		[2049155,50,8],//惊人正义混沌卷轴 50%
		[2049323,50,8],//高级装备强化卷轴
		[4001839,4000,8],//星星
		[3010853,1,8],//心花怒放椅子
		[3016101,1,8],//怪物水晶球秋千椅
		[3012026,1,8],//旋转花茶杯情侣椅子

//8000金额礼包
		[3994417,2,9],//红色蜡笔
		[3994418,2,9],//橙色蜡笔
		[3994419,2,9],//黄色蜡笔
		[3994420,2,9],//绿色蜡笔
		[4001330,2,9],//青色蜡笔
		[3994422,2,9],//蓝色蜡笔
		[2432069,4,9],//暴君防具交换券
		[2430683,30,9],//情人节 卷轴箱子
		[2048721,20,9],//永远涅槃火焰
		[5064000,50,9],//防爆卷轴
		[2340000,100,9],//祝福卷轴
		[5062009,200,9],//超级神奇魔方
		[5062002,300,9],//高级神奇魔方
		[5062500,300,9],//大师附加神奇魔方
		[5062024,150,9],//闪炫魔方
		[2049750,60,9],//S级其潜能卷轴
		[2049155,50,9],//惊人正义混沌卷轴 50%
		[2049323,50,9],//高级装备强化卷轴
		[4001839,5000,9],//星星
		[4001715,10,9],//定居金1亿金钱
		[3010070,1,9],//巨无霸品克缤
		[3010416,1,9],//巨无霸白雪人
		[3010417,1,9],//巨无霸企鹅王
		[3010788,1,9],//巨无霸年夜饭
		[3015051,1,9],//巨无霸国际巨星

		//10000金额礼包
		[2432229,6,10],//卡特琳的礼物 顶级埃苏莱防具自选一套
		[1142742,1,10],//冒险岛奖杯
		//[2430887,1,10],//风暴礼物箱
		[1202173,1,10],//骑马像图腾
		[1202174,1,10],//玉壶图腾
		[1202175,1,10],//青铜香炉图腾
		[2430683,50,10],//情人节 卷轴箱子
		[2048721,30,10],//永远涅槃火焰
		[5062009,200,10],//超级神奇魔方
		[5062002,300,10],//高级神奇魔方
		[5062500,300,10],//大师附加神奇魔方
		[5062024,200,10],//闪炫魔方
		[2049750,70,10],//S级其潜能卷轴
		[2049155,60,10],//惊人正义混沌卷轴 50%
		[2049323,200,10],//高级装备强化卷轴
		[4001839,10000,10],//星星
		[4001715,20,10],//定居金1亿金钱
		[3012019,1,10],//爱琴海椅子
		[3012024,1,10],//沙滩排球椅子
		[3012025,1,10],//小鸡弹簧床椅子
		[3010832,1,10],//太阳椅子
		[3015304,1,10]];//哗啦啦大水车

var giftId = -1;
var giftToken = [];
var gifts = null;
var icon = "#fUI/UIWindow3.img/Scenario/list/icon/icon2/0#";
var iconN = "#fUI/UIWindow3.img/Scenario/list/icon/icon6/0#";

function start() {
	status = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
	if (status == 0 && mode == 0) {
		cm.dispose();
		return;
	}
	if (mode == 1) {
		status++;
	} else {
		status--;
	}
	if (status == 0) {
		var text = "            "+ag+"#r#e小情绪▲充值礼包中心"+ag+"\r\n\r\n";
	   text += "#d当前总充值金额数量：#r"+cm.getTotalRMB()+"#d元\r\n";
	   text += "累计首冲50送140级自选防具\r\n";
	   text += "累计首冲100送140级武器防具自选\r\n";
	   text += "累计首冲300送进阶半半头盔\r\n";
	   text += "累计首冲500送150级法弗纳武器（自选）真红耳环\r\n";
	   text += "累计首冲1000送150级法弗纳防具（自选）伟大的皮埃尔灵魂结晶\r\n";
	   text += "累计首冲1500送暴君防具（自选）最高级贝勒德戒指\r\n";
	   text += "累计首冲2000送遗忘之神话耳环 独眼巨人之眼Lv.3\r\n";
	   text += "累计首冲3000送法弗纳防具（自选）一套\r\n";
	   text += "累计首冲5000送最高级贝勒德一套\r\n";
	   text += "累计首冲8000送神装 暴君防具（自选）一套\r\n";
	   text += "累计首冲10000送顶级神装 埃苏（自选）一套\r\n";
		for (var key in giftLevel) {
			var tips = "";
			giftToken[key] = false;
			if (cm.getRMB() >= giftLevel[key]) {
				if (cm.getEventCount(EventId + giftLevel[key], 1) == 0) {
					tips = " #d#e[未领取]#b";
					giftToken[key] = true;
				} else {
					tips = " #k#e[已领取]#b";
					//icon = iconN;
				}
			} else {
				tips = " #r#e[未充值]#b";
				//icon = iconN;
			}
			//text += "#b#L" + (parseInt(key)) + "#"+ ag +" 领取 #r#e" + giftLevel[key] + "#n#b 赞助礼包 " + tips + "#l#k\r\n";
			text += "#b#L" + (parseInt(key)) + "#" + ag + tips +"累计充值福利             "+ giftLevel[key] + "#l#k\r\n";
		}
		cm.sendSimple(text);
	} else if (status == 1) {
		giftId = parseInt(selection);
		var text = "\t\t\t#e#b第 #r[" + giftLevel[giftId] + "] #b元赞助礼包内容#k#n\r\n\r\n";
		gifts = getGift(giftId);
		for (var key in gifts) {
			var itemId = gifts[key][0];
			var itemQuantity = gifts[key][1];
			text += "\t\t\t#v" + itemId + "# #b#z" + itemId + "# #k[" + itemQuantity + "个]\r\n";
		}
		text += "\r\n#d（提示：领取礼包时请注意背包栏位#r是否有足够多的空位#d！）#k";
		cm.sendYesNo(text);
	} else if (status == 2) {
		if (giftId != -1 && gifts != null) {
			if (cm.getSpace(1) < 8 || cm.getSpace(2) < 8 || cm.getSpace(3) < 8 || cm.getSpace(4) < 8 || cm.getSpace(5) < 8) {
				cm.sendOk("您的背包空间不足，请保证每个栏位至少8格的空间，以避免领取失败。");
				cm.dispose();
				return;
			}
			if (giftToken[giftId] && cm.getEventCount(EventId + giftLevel[giftId], 1) == 0) {
				cm.setEventCount(EventId + giftLevel[giftId]);
				for (var key in gifts) {
					var itemId = gifts[key][0];
					var itemQuantity = gifts[key][1];
					cm.gainItem(itemId, itemQuantity);
					cm.addHyPay(-100);
				}
				cm.sendOk("恭喜您，领取成功！快打开包裹看看吧！");
				cm.worldSpouseMessage(0x15,"『赞助送礼』：祝贺 "+ cm.getChar().getName() +" 领取了 [" + giftLevel[giftId] + "] 元赞助礼包，谢谢你的支持，我们会为你做得更好~");
				cm.dispose();
			} else {
				status = -1;
				cm.sendOk("您已经领过了该礼包或者等级未达到要求，无法领取。");
			}
		} else {
			cm.sendOk("领取错误！请联系管理员！");
			cm.dispose();
		}
	}
}
function getGift(id) {
    var lastGiftContent = [];
    for (var key in giftContent) {
        if (giftContent[key][2] == id)
            lastGiftContent.push(giftContent[key]);
    }
    return lastGiftContent;
}